configuration.org
* Emacs Configuration
** Start-up Message

 Disable this

 #+BEGIN_SRC emacs-lisp
 (setq inhibit-startup-screen t)
 #+END_SRC

 #+RESULTS:
 : t

** Utility Functions

 Resume to original size

 #+BEGIN_SRC emacs-lisp
(defun yizhe/reset-text-size ()
   (interactive)
   (text-scale-set 0)
)
 #+END_SRC

 #+RESULTS:
 : yizhe/reset-text-size

#+BEGIN_SRC emacs-lisp

  (defun yizhe/append-to-path (path)
    "Add a path both to the $PATH variable and Emacs's path"
    (setenv "PATH" (concat (getenv "PATH") ":" path))
    (add-to-list 'exec-path path))

#+END_SRC

#+RESULTS:
: yizhe/append-to-path

Check OS type

#+BEGIN_SRC emacs-lisp
(defmacro with-system (type &rest body)
  "Evaluate BODY if `system-type' equals TYPE."
  (declare (indent defun))
  `(when (eq system-type ',type)
     ,@body))
#+END_SRC

** Performance

 Allow 20MB of memory (instead of 0.76MB) before calling garbage collection. This
 means GC runs less often, which speeds up some operations.

	#+BEGIN_SRC emacs-lisp
		(setq gc-cons-threshold 20000000)
	#+END_SRC

	#+RESULTS:
	: 20000000

 When you perform a problematic operation, flash the screen instead of ringing the terminal bell.

 #+BEGIN_SRC emacs-lisp
   (setq visible-bell t)
 #+END_SRC

 #+RESULTS:
 : t

** Backups

Store backups and auto-saved files in a fixed location rather in the same directory as the file.

#+BEGIN_SRC emacs-lisp
(let ((backup-dir "~/Documents/backups")
      (auto-saves-dir "~/Documents/auto-saves/"))
  (dolist (dir (list backup-dir auto-saves-dir))
    (when (not (file-directory-p dir))
      (make-directory dir t)))
  (setq backup-directory-alist `(("." . ,backup-dir))
        auto-save-file-name-transforms `((".*" ,auto-saves-dir t))
        auto-save-list-file-prefix (concat auto-saves-dir ".saves-")
        tramp-backup-directory-alist `((".*" . ,backup-dir))
        tramp-auto-save-directory auto-saves-dir))

(setq backup-by-copying t    ; Don't delink hardlinks
      delete-old-versions t  ; Clean up the backups
      version-control t      ; Use version numbers on backups,
      kept-new-versions 5    ; keep some new versions
      kept-old-versions 2)   ; and some old ones, too
#+END_SRC

#+RESULTS:
: 2

** Whitespaces

Clean up whitespace when saving

#+BEGIN_SRC emacs-lisp
  "Call DELETE-TRAILING-WHITESPACE every time a buffer is saved."
  (add-hook 'before-save-hook 'delete-trailing-whitespace)

#+END_SRC

#+RESULTS:
| gofmt-before-save | (lambda nil (if buffer-file-name (progn (let ((dir (file-name-directory buffer-file-name))) (if (and (not (file-exists-p dir)) (y-or-n-p (format Directory %s does not exist. Create it? dir))) (progn (make-directory dir t))))))) | delete-trailing-whitespace |

One space after a period

#+BEGIN_SRC emacs-lisp
  "Don't assume that sentences should have two spaces after
periods. This ain't a typewriter."
#+END_SRC

#+RESULTS:
: Don't assume that sentences should have two spaces after
: periods. This ain't a typewriter.

If you save a file that doesn't end with a newline, automatically append one.
#+BEGIN_SRC emacs-lisp
(setq require-final-newline t)
#+END_SRC

#+RESULTS:
: t

** =#!= executable

When saving a file that starts with `#!', make it executable.

#+BEGIN_SRC emacs-lisp
	(add-hook 'after-save-hook
						'executable-make-buffer-file-executable-if-script-p)
#+END_SRC

#+RESULTS:
| executable-make-buffer-file-executable-if-script-p | rmail-after-save-hook |

** Files & Directories

Refresh buffer when file had changed

#+BEGIN_SRC emacs-lisp
(global-auto-revert-mode t)
#+END_SRC

#+RESULTS:
: t

Offer to create parent directory when saving a file to a directory that doesn't exists

#+BEGIN_SRC emacs-lisp
  "When saving a file in a directory that doesn't exist, offer
to (recursively) create the file's parent directories."
  (add-hook 'before-save-hook
            (lambda ()
              (when buffer-file-name
                (let ((dir (file-name-directory buffer-file-name)))
                  (when (and (not (file-exists-p dir))
                             (y-or-n-p (format "Directory %s does not exist. Create it?" dir)))
                    (make-directory dir t))))))
#+END_SRC

#+RESULTS:
| (lambda nil (when buffer-file-name (let ((dir (file-name-directory buffer-file-name))) (when (and (not (file-exists-p dir)) (y-or-n-p (format Directory %s does not exist. Create it? dir))) (make-directory dir t))))) | gofmt-before-save | (lambda nil (if buffer-file-name (progn (let ((dir (file-name-directory buffer-file-name))) (if (and (not (file-exists-p dir)) (y-or-n-p (format Directory %s does not exist. Create it? dir))) (progn (make-directory dir t))))))) | delete-trailing-whitespace |

Add file sizes in human-readable units (KB, MB, etc) to dired buffers.

#+BEGIN_SRC emacs-lisp
	(setq-default dired-listing-switches "-alh")
#+END_SRC

#+RESULTS:
: -alh

** Editing

Syntax highlighting always on

#+BEGIN_SRC emacs-lisp
(global-font-lock-mode t)
#+END_SRC

#+RESULTS:
: t

Visual indication of matching pairs of parentheses

#+BEGIN_SRC emacs-lisp
(show-paren-mode t)
(setq show-paren-delay 0.0)
#+END_SRC

#+RESULTS:
: 0.0

Set default line length to 80

#+BEGIN_SRC emacs-lisp
(setq-default fill-column 80)
#+END_SRC

#+RESULTS:
: 80

If I highlighted some text and just started typing onto it, just delete that text

#+BEGIN_SRC emacs-lisp
	"If some text is selected, and you type some text, delete the
	selected text and start inserting your typed text."
	(delete-selection-mode 1)

#+END_SRC

#+RESULTS:
: t

y/n instead of yes/no

#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

#+RESULTS:
: y-or-n-p

** Key Bindings

Make <home> and <end> move point to the beginning and end of the line, respectively.

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "<home>") 'move-beginning-of-line)
  (global-set-key (kbd "<end>") 'move-end-of-line)
#+END_SRC

#+RESULTS:
: move-end-of-line

Zoom! =C-+= and =C--= makes sense

#+BEGIN_SRC emacs-lisp
	(define-key global-map (kbd "C-0") 'yizhe/reset-text-size)
	(define-key global-map (kbd "C-=") 'text-scale-increase)
	(define-key global-map (kbd "C--") 'text-scale-decrease)
#+END_SRC

#+RESULTS:
: text-scale-decrease

Search keys

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-s") 'isearch-forward-regexp)
(global-set-key (kbd "C-r") 'isearch-backward-regexp)
(global-set-key (kbd "C-M-s") 'isearch-forward)
(global-set-key (kbd "C-M-r") 'isearch-backward)
#+END_SRC

#+RESULTS:
: isearch-backward

If mac, use command key as meta instead of option

#+BEGIN_SRC emacs-lisp
; set command key to be meta instead of option
(with-system darwin
    (setq mac-command-modifier 'meta))
#+END_SRC

#+RESULTS:
: meta

** TODO Spell Checking
** TODO Lots of Cursors (configure this)

#+BEGIN_SRC emacs-lisp
(use-package multiple-cursors
  :ensure t)
#+END_SRC

#+RESULTS:
: mc/mark-all-like-this

#+BEGIN_SRC emacs-lisp
		(setq-default ispell-program-name "hunspell")
		(use-package ispell
		 :init
		 (setq ispell-dictionary-alist
			'(
				("en_US"
				 "[[:alpha:]]"
				 "[^[:alpha:]]"
				 "[']"
				 t
				 ("-d" "en_US" "-p" "/usr/share/hunspell/en_US")
				 nil
				 iso-8859-1)
				))
		 (setq ispell-dictionary "en_US")
		)
#+END_SRC

#+RESULTS:
** TODO Yesnippet

http://www.totherme.org/configs/gds.html#orgheadline14

** Comapny Mode

Complete everything when type

#+BEGIN_SRC emacs-lisp
	(use-package company
		:ensure t
		:defer 5
		:diminish company-mode
		:config
		(use-package company-yasnippet))

#+END_SRC

#+RESULTS:
: t

* About me

 #+BEGIN_SRC emacs-lisp
   (setq user-full-name "Yizhe Xu"
	 user-mail-address "me@yizhexu.com"
         calendar-latitude 39.7
         calendar-longitude -104.9)
 #+END_SRC

 #+RESULTS:
 : -104.9

* UI
** Maximize Screen

Hide this and that to maximize screen area

#+BEGIN_SRC emacs-lisp
(menu-bar-mode 0)
(tool-bar-mode 0)
(scroll-bar-mode -1)
(horizontal-scroll-bar-mode -1)

;; also this mini scroll bar
(set-window-scroll-bars (minibuffer-window) nil nil)
#+END_SRC

#+RESULTS:

** Window

Change frame name to something more helpful

#+BEGIN_SRC emacs-lisp
(setq frame-title-format '((:eval (projectile-project-name))))
#+END_SRC

#+RESULTS:
| :eval | (projectile-project-name) |

Use =neotree= to give a nice tree view of project directory

#+BEGIN_SRC emacs-lisp
	(use-package neotree
		:bind ([f8] . neotree-toggle))
#+END_SRC

#+RESULTS:
: neotree-toggle

** Theme

# I've been using material theme for a while. [[https://github.com/hrs/dotfiles/blob/master/emacs/.emacs.d/configuration.org#load-up-a-theme][Make theme a bit transparent]]

#+BEGIN_SRC emacs-lisp
	(defun transparency (value)
		"set transparency of the frame window. 0=transparent/ 100=opaque"
		(interactive "nTransparency Value 0-100 opaque:")
		(set-frame-parameter (selected-frame) 'alpha value))

	(defun apply-theme()
		"use the theme and make frame a bit transparent"
		(interactive)
		(load-theme 'material t)
		(transparency 93))

#+END_SRC

#+RESULTS:
: with-system

#+BEGIN_SRC emacs-lisp
	(with-system gnu/linux
			(if (daemonp)
					(add-hook 'after-make-frame-functions
										(lambda (frame)
											(with-selected-frame frame (apply-theme))))
				(apply-theme)))

	(with-system darwin
		(add-hook 'after-make-frame-functions
											(lambda (frame)
												(with-selected-frame frame (apply-theme))))
		(apply-theme))
#+END_SRC

#+RESULTS:

** Font

#+BEGIN_SRC emacs-lisp
(set-default-font "Hack-12")
#+END_SRC

#+RESULTS:

** Fancy Lambdas

#+BEGIN_SRC emacs-lisp
(global-prettify-symbols-mode t)
#+END_SRC

#+RESULTS:
: t

** Scroll

Less when hit the key so I can find stuff

#+BEGIN_SRC emacs-lisp
(setq scroll-conservatively 100)
#+END_SRC

#+RESULTS:
: 100

** Time

Show a clock

#+BEGIN_SRC emacs-lisp
(setq display-time-24hr-format t)
(display-time-mode 1)
#+END_SRC

#+RESULTS:
: t

** Minibuffer

Sometimes cursor get stuck in minibuffer is annoying

#+BEGIN_SRC emacs-lisp
	(setq minibuffer-prompt-properties
				(quote
				 (read-only t point-entered minibuffer-avoid-prompt face minibuffer-prompt)))
#+END_SRC

#+RESULTS:
| read-only | t | point-entered | minibuffer-avoid-prompt | face | minibuffer-prompt |

* Programming Languages

Append path of my programs

#+BEGIN_SRC emacs-lisp
(yizhe/append-to-path "/usr/bin")
(yizhe/append-to-path "/usr/local/bin")
#+END_SRC

#+RESULTS:
| /usr/local/bin | /usr/local/anaconda3/bin | /home/yizhe/Go/bin | /usr/bin | /bin | /usr/sbin | /sbin | /usr/local/Cellar/emacs/26.1_1/libexec/emacs/26.1/x86_64-apple-darwin17.7.0 |

Change tab width to 2 characters

#+BEGIN_SRC emacs-lisp
(setq-default tab-width 2)
#+END_SRC

For camelCase words, move through them as one word

#+BEGIN_SRC emacs-lisp
(global-subword-mode 1)
#+END_SRC

Compilation be more obvious

#+BEGIN_SRC emacs-lisp
(setq compilaton-scroll-output t)
#+END_SRC

