configuration.el
(setq inhibit-startup-screen t)

(defun sensible-defaults/reset-text-size ()
  (interactive)
  (text-scale-set 0))

"Allow 20MB of memory (instead of 0.76MB) before calling
garbage collection. This means GC runs less often, which speeds
up some operations."
  (setq gc-cons-threshold 20000000)

(setq visible-bell t)

(let ((backup-dir "~/Documents/backups")
      (auto-saves-dir "~/Documents/auto-saves/"))
  (dolist (dir (list backup-dir auto-saves-dir))
    (when (not (file-directory-p dir))
      (make-directory dir t)))
  (setq backup-directory-alist `(("." . ,backup-dir))
        auto-save-file-name-transforms `((".*" ,auto-saves-dir t))
        auto-save-list-file-prefix (concat auto-saves-dir ".saves-")
        tramp-backup-directory-alist `((".*" . ,backup-dir))
        tramp-auto-save-directory auto-saves-dir))

(setq backup-by-copying t    ; Don't delink hardlinks
      delete-old-versions t  ; Clean up the backups
      version-control t      ; Use version numbers on backups,
      kept-new-versions 5    ; keep some new versions
      kept-old-versions 2)   ; and some old ones, too

"Call DELETE-TRAILING-WHITESPACE every time a buffer is saved."
(add-hook 'before-save-hook 'delete-trailing-whitespace)

"Don't assume that sentences should have two spaces after
periods. This ain't a typewriter."

(setq require-final-newline t)

"When saving a file that starts with `#!', make it executable."
(add-hook 'after-save-hook
          'executable-make-buffer-file-executable-if-script-p)

(global-auto-revert-mode t)

"When saving a file in a directory that doesn't exist, offer
to (recursively) create the file's parent directories."
  (add-hook 'before-save-hook
            (lambda ()
              (when buffer-file-name
                (let ((dir (file-name-directory buffer-file-name)))
                  (when (and (not (file-exists-p dir))
                             (y-or-n-p (format "Directory %s does not exist. Create it?" dir)))
                    (make-directory dir t))))))

(setq-default dired-listing-switches "-alh")

(global-font-lock-mode t)

(show-paren-mode t)
(setq show-paren-delay 0.0)

(setq-default fill-column 80)

"If some text is selected, and you type some text, delete the
selected text and start inserting your typed text."
(delete-selection-mode t)

(fset 'yes-or-no-p 'y-or-n-p)

(global-set-key (kbd "<home>") 'move-beginning-of-line)
(global-set-key (kbd "<end>") 'move-end-of-line)

(define-key global-map (kbd "C-)") 'sensible-defaults/reset-text-size)
(define-key global-map (kbd "C-+") 'text-scale-increase)
(define-key global-map (kbd "C-=") 'text-scale-increase)
(define-key global-map (kbd "C-_") 'text-scale-decrease)
(define-key global-map (kbd "C--") 'text-scale-decrease)

(global-set-key (kbd "C-s") 'isearch-forward-regexp)
(global-set-key (kbd "C-r") 'isearch-backward-regexp)
(global-set-key (kbd "C-M-s") 'isearch-forward)
(global-set-key (kbd "C-M-r") 'isearch-backward)

(setq user-full-name "Yizhe Xu"
      user-mail-address "me@yizhexu.com"
      calendar-latitude 39.7
      calendar-longitude -104.9)

(defun yizhe/append-to-path (path)
  "Add a path both to the $PATH variable and Emacs's path"
  (setenv "PATH" (concat (getenv "PATH") ":" path))
  (add-to-list 'exec-path path))

(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(horizontal-scroll-bar-mode -1)

;; also this mini scroll bar
(set-window-scroll-bars (minibuffer-window) nil nil)

(setq frame-title-format '((:eval (projectile-project-name))))

(use-package neotree
	:bind ([f8] . neotree-toggle))

(defun transparency (alpha)
  "set transparency of the frame window. 0=transparent/ 100=opaque"
  (interactive "Transparency Value 0-100 opaque:")
  (set-frame-parameter (selected-frame) 'alpha alpha))

(defun apply-theme()
  "use the theme and make frame a bit transparent"
  (interactive)
  (load-theme 'material t)
  (transparency 90))

(if (daemonp)
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (with-selected-frame frame (apply-theme))))
  (apply-theme))

(set-default-font "Hack-12")

(global-prettify-symbols-mode t)

(setq scroll-conservatively 100)

(setq-default tab-width 2)

(global-subword-mode 1)

(setq compilaton-scroll-output t)
