configuration.org
** Tramp

Parse =.ssh/config= to figure out users and hosts.

#+BEGIN_SRC
 (tramp-set-completion-function "ssh"
           '((tramp-parse-sconfig "/etc/ssh_config")
             (tramp-parse-sconfig "~/.ssh/config")))
#+END_SRC

 #+RESULTS:
 | ssh     | (tramp-parse-sconfig ~/.ssh/config)   |                                         |                                     |
 | fcp     | (tramp-parse-rhosts /etc/hosts.equiv) | (tramp-parse-shosts ~/.ssh/known_hosts) | (tramp-parse-sconfig ~/.ssh/config) |
 | psftp   | (tramp-parse-rhosts /etc/hosts.equiv) | (tramp-parse-shosts ~/.ssh/known_hosts) | (tramp-parse-sconfig ~/.ssh/config) |
 | pscp    | (tramp-parse-rhosts /etc/hosts.equiv) | (tramp-parse-shosts ~/.ssh/known_hosts) | (tramp-parse-sconfig ~/.ssh/config) |
 | plink   | (tramp-parse-rhosts /etc/hosts.equiv) | (tramp-parse-shosts ~/.ssh/known_hosts) | (tramp-parse-sconfig ~/.ssh/config) |
 | krlogin | (tramp-parse-rhosts /etc/hosts.equiv) |                                         |                                     |
 | sg      | (tramp-parse-etc-group /etc/group)    |                                         |                                     |
 | ksu     | (tramp-parse-passwd /etc/passwd)      |                                         |                                     |
 | doas    | (tramp-parse-passwd /etc/passwd)      |                                         |                                     |
 | sudo    | (tramp-parse-passwd /etc/passwd)      |                                         |                                     |
 | su      | (tramp-parse-passwd /etc/passwd)      |                                         |                                     |
 | nc      | (tramp-parse-hosts /etc/hosts)        |                                         |                                     |
 | telnet  | (tramp-parse-hosts /etc/hosts)        |                                         |                                     |
 | sshx    | (tramp-parse-rhosts /etc/hosts.equiv) | (tramp-parse-shosts ~/.ssh/known_hosts) | (tramp-parse-sconfig ~/.ssh/config) |
 | remsh   | (tramp-parse-rhosts /etc/hosts.equiv) |                                         |                                     |
 | rsh     | (tramp-parse-rhosts /etc/hosts.equiv) |                                         |                                     |
 | rsync   | (tramp-parse-rhosts /etc/hosts.equiv) | (tramp-parse-shosts ~/.ssh/known_hosts) | (tramp-parse-sconfig ~/.ssh/config) |
 | scpx    | (tramp-parse-rhosts /etc/hosts.equiv) | (tramp-parse-shosts ~/.ssh/known_hosts) | (tramp-parse-sconfig ~/.ssh/config) |
 | scp     | (tramp-parse-rhosts /etc/hosts.equiv) | (tramp-parse-shosts ~/.ssh/known_hosts) | (tramp-parse-sconfig ~/.ssh/config) |
 | remcp   | (tramp-parse-rhosts /etc/hosts.equiv) |                                         |                                     |
 | rcp     | (tramp-parse-rhosts /etc/hosts.equiv) |                                         |                                     |
 | adb     | (tramp-adb-parse-device-names )       |                                         |                                     |

#+BEGIN_SRC sh /ssh:sphynx:/
pwd
#+END_SRC

#+RESULTS:
: /Users/p2762265/.emacs.d

 Use =tramp= to start a process on remote machine, requires config as below in =.ssh=

 #+BEGIN_EXAMPLE
	 Host sphynx
				Hostname sphynx.lab.com
				User yxu
				IdentityFile ~/.ssh/my_amazon_key.pem
				ForwardX11 yes
 #+END_EXAMPLE

** Golang

Configure my =$GOPATH= and tell Emacs where my Go binaries are at

#+BEGIN_SRC emacs-lisp
(setenv "GOPATH" "/home/yizhe/Go")
(yizhe/append-to-path (concat (getenv "GOPATH") "/bin"))
#+END_SRC

#+RESULTS:
| /home/yizhe/Go/bin | /usr/local/bin | /usr/local/sbin | /usr/bin | /opt/cuda/bin | /usr/bin/site_perl | /usr/bin/vendor_perl | /usr/bin/core_perl | /usr/lib/emacs/26.1/x86_64-pc-linux-gnu |

Run =goimports= before saving. It formats the code and also updates the imports.
#+BEGIN_SRC emacs-lisp
(setq gofmt-command "goimports")
(add-hook 'before-save-hook 'gofmt-before-save)
#+END_SRC

#+RESULTS:
| gofmt-before-save |

When open a Go source code:

- Start up =company-mode= with the Go backend. This requires that the =gocode=
  binary is installed,
- Redefine the default =compile= command to something Go-specific, and
- Enable =flycheck=.

#+BEGIN_SRC emacs-lisp
(add-hook 'go-mode-hook
          (lambda ()
            (set (make-local-variable 'company-backends)
                 '(company-go))
            (company-mode)
            (if (not (string-match "go" compile-command))
                (set (make-local-variable 'compile-command)
                     "go build -v && go test -v && go vet"))
            (flycheck-mode)))

#+END_SRC

#+RESULTS:
| lambda | nil | (set (make-local-variable (quote company-backends)) (quote (company-go))) | (company-mode) | (if (not (string-match go compile-command)) (set (make-local-variable (quote compile-command)) go build -v && go test -v && go vet)) | (flycheck-mode) |

** Lisps

Some configuration for =emacs-lisp=

#+BEGIN_SRC emacs-lisp
(setq lispy-mode-hooks
      '(emacs-lisp-mode-hook
        lisp-mode-hook))

(dolist (hook lispy-mode-hooks)
  (add-hook hook (lambda ()
                   (setq show-paren-style 'expression)
                   (paredit-mode)
                   (rainbow-delimiters-mode))))
#+END_SRC

#+RESULTS:

=eldoc-mode= to display documentation for Emacs

#+BEGIN_SRC emacs-lisp
(add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
#+END_SRC

#+RESULTS:
| eldoc-mode | (lambda nil (setq show-paren-style (quote expression)) (paredit-mode) (rainbow-delimiters-mode)) | (lambda nil (flyspell-prog-mode)) |

** Magit

Quickly view git status with =C-x g=

Enable spellchecking for commit messages.

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :bind ("C-x g" . magit-status)

    :config
    (use-package evil-magit)
    (setq git-commit-summary-max-length 50)
    (add-hook 'git-commit-mode-hook 'turn-on-flyspell))
#+END_SRC

Highlight uncommited changes

#+BEGIN_SRC emacs-lisp
(require 'diff-hl)

(add-hook 'prog-mode-hook 'turn-on-diff-hl-mode)
(add-hook 'vc-dir-mode-hook 'turn-on-diff-hl-mode)
#+END_SRC

#+RESULTS:
| turn-on-diff-hl-mode |

** Python

Add =/opt/anaconda/bin= to load path.

#+BEGIN_SRC emacs-lisp
(with-system gnu/linux (yizhe/append-to-path "/opt/anaconda/bin"))
(with-system darwin (yizhe/append-to-path "/usr/local/anaconda3/bin"))
#+END_SRC

#+RESULTS:
| /usr/local/anaconda3/bin | /opt/anaconda/bin | /home/yizhe/Go/bin | /usr/bin | /bin | /usr/sbin | /sbin | /usr/local/Cellar/emacs/26.1_1/libexec/emacs/26.1/x86_64-apple-darwin17.7.0 |

Configure my coda environments

#+BEGIN_SRC emacs-lisp
  ; where to look for environments
(with-system gnu/linux (setenv "WORKON_HOME" "/home/yizhe/.conda/envs"))
(with-system darwin (setenv "WORKON_HOME" "/usr/local/anaconda3/envs"))
(pyvenv-mode 1)
#+END_SRC

#+RESULTS:
: t

Use =elpy=, it is nice!

#+BEGIN_SRC emacs-lisp
;; enable elpy
(elpy-enable)
#+END_SRC

Use =ipython= interpreter with elpy

#+BEGIN_SRC emacs-lisp
;; ipython interpreter
  (setq python-shell-interpreter "jupyter"
        python-shell-interpreter-args "console --simple-prompt"
        python-shell-prompt-detect-failure-warning nil)
  (add-to-list 'python-shell-completion-native-disabled-interpreters
               "jupyter")
#+END_SRC

#+RESULTS:
| jupyter | pypy | ipython |

#+BEGIN_SRC emacs-lisp
;; syntax check on the fly
(when (require 'flycheck nil t)
    (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
    (add-hook 'elpy-mode-hook 'flycheck-mode))
#+END_SRC

#+RESULTS:
| flycheck-mode |

Format code according to =PEP8= when save:
#+BEGIN_SRC emacs-lisp
(require 'py-autopep8)
(add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save)
#+END_SRC

#+RESULTS:
| py-autopep8-enable-on-save | flycheck-mode |


=Jedi= for auto-completion

#+BEGIN_SRC emacs-lisp
(add-to-list 'company-backends 'company-jedi)
(add-hook 'python-mode-hook 'jedi:setup)
(setq jedi:complete-on-dot t)
#+END_SRC

#+RESULTS:
: t

** Shell

Indent with 2 spaces.

#+BEGIN_SRC emacs-lisp
(add-hook 'sh-mode-hook
          (lambda ()
            (setq sh-basic-offset 2
                  sh-indentation 2)))
#+END_SRC

#+RESULTS:
| (lambda nil (setq sh-basic-offset 2 sh-indentation 2)) | sh-electric-here-document-mode |

** Terminal

=multi-term= bound to =C-c t=

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c t") 'multi-term)
#+END_SRC

#+RESULTS:
: multi-term

Use a login shell

#+BEGIN_SRC emacs-lisp
(setq multi-term-program-switches "--login")
#+END_SRC

#+RESULTS:
: --login

Some hooks to =term-mode=:
- Clickable Urls

#+BEGIN_SRC emacs-lisp
  (add-hook 'term-mode-hook
            (lambda ()
              (goto-address-mode)))
#+END_SRC

** Scala

=scala-mode= and =sbt-mode= needs to be installed

#+BEGIN_SRC emacs-lisp
  (use-package scala-mode
    :interpreter
    ("scala" . scala-mode))
  (use-package sbt-mode)

#+END_SRC

And mute the start-up message

#+BEGIN_SRC emacs-lisp
(setq ensime-startup-notification nil)
#+END_SRC

** R

*** ESS - Emacs Speaks Statistics

Enable ess

#+BEGIN_SRC emacs-lisp
 (use-package ess
  :ensure t
  :init (require 'ess-site))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC
(setq ess-R-font-lock-keywords
    '((ess-R-fl-keyword:modifiers . t)
     (ess-R-fl-keyword:fun-defs . t)
     (ess-R-fl-keyword:keywords . t)
     (ess-R-fl-keyword:assign-ops)
     (ess-R-fl-keyword:constants . t)
     (ess-fl-keyword:fun-calls . t)
     (ess-fl-keyword:numbers)
     (ess-fl-keyword:operators)
     (ess-fl-keyword:delimiters)
     (ess-fl-keyword:=)
     (ess-R-fl-keyword:F&T)
     (ess-R-fl-keyword:%op%)))

(add-hook 'ess-mode-hook 'turn-on-pretty-mode)
#+END_SRC

#+RESULTS:
| turn-on-pretty-mode | ess-S-mouse-me-menu-commands | ess-r-setup-flymake |

*** =company-mode=

Activate company mode with ESS

#+BEGIN_SRC emacs-lisp
	(setq ess-use-company t
				company-selection-wrap-around t
				company-tooltip-align-annotations t
				company-idle-delay 0.36
				company-show-numbers t
				company-tooltip-flip-when-above t
				company-minimum-prefix-length 2
				company-tooltip-limit 10)

#+END_SRC

#+RESULTS:
: 10

Display quick help

#+BEGIN_SRC emacs-lisp
(define-key company-active-map (kbd "M-h") 'company-show-doc-buffer)
#+END_SRC

#+RESULTS:
: company-show-doc-buffer

Completion keys

#+BEGIN_SRC emacs-lisp
(define-key company-active-map [return] nil)
(define-key company-active-map [tab] 'company-complete-common)
(define-key company-active-map (kbd "TAB") 'company-complete-common)
(define-key company-active-map (kbd "M-TAB") 'company-complete-selection)
#+End_Src

#+RESULTS:
: company-complete-selection

Bind =M-,= as next in auto-complete, =M-k= as previous.

 #+BEGIN_SRC emacs-lisp
 (define-key company-active-map (kbd "M-n") nil)
 (define-key company-active-map (kbd "M-p") nil)
 (define-key company-active-map (kbd "M-,") 'company-select-next)
 (define-key company-active-map (kbd "M-k") 'company-select-previous)
 #+END_SRC

 An example is like:

 #+BEGIN_SRC R
	 library(ggplot2)

	 ggplot(mpg, aes(displ, hwy, Colour = class)) +
			 geom_point() +
			 geom_abline
 #+END_SRC

*** Use R with  =org-mode=

 When use R with =org-mode=, Don't need to double check before evaluate with =C-c C-c=

 #+BEGIN_SRC emacs-lisp
 (setq org-confirm-babel-evaluate nil)
 #+END_SRC

 Enable graphical output

 #+BEGIN_SRC emacs-lisp
 (add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
 (add-hook 'org-mode-hook 'org-display-inline-images)
 #+END_SRC

 #+RESULTS:
 | org-display-inline-images | flyspell-mode | org-bullets-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-block-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

 Some inline example SRC_R[:exports results]{round(pi, 2)}

 Autocomplete with =tab=

 #+BEGIN_SRC emacs-lisp
 ;; start auto-complete with emacs
 (setq ess-use-company 'script-only)
 #+END_SRC

 #+RESULTS:
 : script-only

 #+RESULTS:
 : company-select-previous

* =org-mode=
** Keyboard shortcuts

	These are the shortcuts I'm trying to use

	#+BEGIN_SRC emacs-lisp
		(global-set-key (kbd "C-c o")
											(lambda () (interactive) (find-file org-index-file))) ;; access to my index-org everywhere

		(bind-key "C-c r" 'org-capture)
		(bind-key "C-c a" 'org-agenda)
		(bind-key "<f9> <f9>" 'org-agenda-list)
		(bind-key "<f9> <f8>" (lambda () (interactive) (org-capture nil "r")))
	#+END_SRC

Quickly visit =configuration.org= file

#+BEGIN_SRC emacs-lisp
(defun visit-emacs-config ()
  (interactive)
  (find-file "~/.emacs.d/configuration.org"))

(global-set-key (kbd "C-c e") 'visit-emacs-config)
#+END_SRC

	#+RESULTS:
	: visit-emacs-config

