configuration.org
** Display Preferences

 Pretty bullet, outline, etc

 #+BEGIN_SRC emacs-lisp
 (use-package org-bullets
   :init
   (add-hook 'org-mode-hook #'org-bullets-mode))

 #+END_SRC

 If there's content under a header, show a little downward pointing arrow from [[https://github.com/hrs/dotfiles][hrs's dotfiles]]

 #+BEGIN_SRC emacs-lisp
 (setq org-ellipsis "⤵")
 #+END_SRC

 #+RESULTS:
 : ⤵

 Syntax highlighting enable in source code block

 #+BEGIN_SRC emacs-lisp
 (setq org-src-fontify-natively t)
 #+END_SRC

 #+RESULTS:
 : t

 Make TAB act as if it were issued in a buffer of the language's major mode.

 #+BEGIN_SRC emacs-lisp
   (setq org-src-tab-acts-natively t)
 #+END_SRC

 Enable spell-checking in Org-mode.

 #+BEGIN_SRC emacs-lisp
   (add-hook 'org-mode-hook 'flyspell-mode)
 #+END_SRC

 #+RESULTS:
 | flyspell-mode | org-bullets-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-block-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** Task Management

My org file is stored in =~/Documents/org=, finished tasks will be archived in
=~/Documents/org/archive.org=, and all the tasks stores in
=~/Documents/org/index.org=

| index.org | Main org file. Inbox for org-capture |
| yizhe.org | My knowledge management              |

#+BEGIN_SRC emacs-lisp
	(setq org-directory "~/Documents/org")

	(defun org-file-path (filename)
		"Return the absolute address of an org file, given its relative name."
		(concat (file-name-as-directory org-directory) filename))

	(setq org-index-file (org-file-path "index.org"))
	(setq org-archive-location
				(concat (org-file-path "archive.org") "::* From %s"))
#+END_SRC

Agenda should be derived from =index.org=

#+BEGIN_SRC emacs-lisp
(setq org-agenda-files (list org-index-file))
#+END_SRC

#+RESULTS:
| ~/Documents/org/index.org |

=C-c i= quickly open up todo list

#+BEGIN_SRC emacs-lisp
(defun open-index-file ()
  "Open the master org TODO list."
  (interactive)
  (find-file org-index-file)
  (flycheck-mode -1)
  (end-of-buffer))

(global-set-key (kbd "C-c i") 'open-index-file)
#+END_SRC

#+RESULTS:
: open-index-file

Hitting =C-c C-x C-s= will mark a todo as done and move it to an appropriate
place in the archive.

#+BEGIN_SRC emacs-lisp
(defun mark-done-and-archive ()
  "Mark the state of an org-mode item as DONE and archive it."
  (interactive)
  (org-todo 'done)
  (org-archive-subtree))

(define-key org-mode-map (kbd "C-c C-x C-s") 'mark-done-and-archive)
#+END_SRC

#+RESULTS:
: mark-done-and-archive

Record the time that a todo was archived.

#+BEGIN_SRC emacs-lisp
(setq org-log-done 'time)
#+END_SRC

*** Capturing Tasks

Probably would need to quickly capture:

- List of todo in =~/Documents/index.org=

#+BEGIN_SRC emacs-lisp
	(setq org-capture-templates
				'(
					("t" "Todo" entry (file+headline org-index-file "Inbox")
					 "* TODO %? %U" :empty-lines 1)

					("s" "Scheduled Todo" entry (file+headline org-index-file "Inbox")
					 "* TODO %? %^G \nSCHEDULED: %^t\n  %U" :empty-lines 1)

	))
#+END_SRC

#+RESULTS:
| t | Todo | entry | (file+headline org-index-file Inbox) | basic-task-template |
** Exporting

Allow =babel= to evaluate Emacs lisp code

#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)))
#+END_SRC

Don’t ask before evaluating code blocks.

#+BEGIN_SRC emacs-lisp
(setq org-confirm-babel-evaluate nil)
#+END_SRC

** Source Code

Source code that =org-babel= wants to evaluate

#+BEGIN_SRC emacs-lisp
	(org-babel-do-load-languages
			 'org-babel-load-languages
			 '((emacs-lisp . t)
				 (R . t)
				 (latex . t)
				 (python . t)
				 (shell . t)
				 (latex . t)
				 (gnuplot . t)
				 (sql . t)))
#+END_SRC

#+RESULTS:

When editing a code snippet, use the current window rather than popping open a new one (which shows the same information).

#+BEGIN_SRC emacs-lisp
(setq org-src-window-setup 'current-window)
#+END_SRC

#+RESULTS:
: current-window

*** Emacs Lisp

 Quickly insert a block of elisp:

 #+BEGIN_SRC emacs-lisp
   (add-to-list 'org-structure-template-alist
								'("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))
 #+END_SRC

*** R

 Quickly insert a block of R:

 #+BEGIN_SRC emacs-lisp
   (add-to-list 'org-structure-template-alist
								'("r" "#+BEGIN_SRC R :session *R*\n?\n#+END_SRC"))
 #+END_SRC

 #+RESULTS:
 | r | #+BEGIN_SRC R :session *R* |
